# ReDrawAll

## Description
Procedure ReDrawAll invokes a full screen redraw of the active Vectorworks document. ReDrawAll is used when the document view needs to be refreshed prior to additional operation being performed in the document.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE ReDrawAll;
```

```python

def vs.ReDrawAll():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Utility